<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"0ac567b7da9d89333a2c3a380f64a135c7fde207ec160b0be3853cc5ab6f78ac","plan_job_ref":"Job Staging Environment #101 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/12466383257","plan_out_hash":"08e2e16ed607e060685c680dfc3233d2d1a1825da22ed06067b1217b1b610686","plan_hash":"c60e34190e0679eab06dd93a949225599a52924e64bc01d87e153222b1092714","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EOUIG3G6N7CQQ"
        tags                            = {}
#        (23 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
#            (4 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.object will be updated in-place
!~  resource "aws_s3_object" "object" {
!~      etag                          = "094b4ed3c025e32b733df3010ad9293c" -> "1fb4d122156418e8b75770b3de6090cd"
        id                            = "index.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (24 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #101](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/12466383257)